app/views/home/gossip.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    <div class="container">
        <h1 class="display-3"><%= @gossip.user.first_name %> <%= @gossip.user.last_name %></h1>