app/views/home/home.html.erb

      <div class="card-body text-dark">
        <h5 class="card-title"><%= gossip.user.first_name %> <%= gossip.user.last_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]