app/controllers/home_controller.rb

  def home
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def gossip
    @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def author
    @user = User.find(params[:id])
    @author_gossips = @user.gossips.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = ?  [["user_id", 10]]